In [1]:
library(RMySQL)

Loading required package: DBI

In [60]:
# DB connection
conn <- dbConnect(MySQL(),
  dbname = 'RSQL',
  user = 'root',
  password = 'qwer1234',
  host = '192.168.150.167'
)

In [5]:
# table 목록
dbListTables(conn)

[1] "score"

In [6]:
# 테이블의 컬럼 목록
dbListFields(conn, 'score')

[1] "id"         "korean"     "english"    "mathmatics"

In [48]:
# Select
dbGetQuery(conn, 'select count(*) from score')

  count(*)
1 12

In [51]:
dbGetQuery(conn,'select * from score')

   id korean english mathematics
1   1  90     80      70
2   2  90     88      70
3   3  90     89      70
4   4  90     87      70
5   5  90     60      70
6   6 100    100     100
7   7 100    100     100
8   8 100    100     100
9   9 100    100     100
10 10 100    100     100

In [54]:
# insert
dbSendQuery(conn, 'insert into score values (2022,18,18,18)')

result = dbGetQuery(conn, 'select * from score')
result

   id   korean english mathematics
1     1  90     80      70
2     2  90     88      70
3     3  90     89      70
4     4  90     87      70
5     5  90     60      70
6     6 100    100     100
7     7 100    100     100
8     8 100    100     100
9     9 100    100     100
10   10 100    100     100
11 2020  18     18      18
12 2021  18     18      18
13 2022  18     18      18

In [12]:
dbSendQuery(conn,'insert into score values (2,90,90,90)')

result = dbGetQuery(conn, 'select * from score')
result

  id korean english mathmatics
1 1  100    100     100
2 2   90     90      90

In [13]:
# update
dbSendQuery(conn,'update score set korean=90, english=80, mathmatics=70 where id=2')

result = dbGetQuery(conn, 'select * from score')
result

  id korean english mathmatics
1 1  100    100     100
2 2   90     80      70

In [15]:
# delete
#dbSendQuery(conn,'delete from score') # db 전체 지우기

result = dbGetQuery(conn, 'select * from score')
result

     id korean english mathmatics

### csv file 한번에 올리기 위한 sql 실행문
SHOW VARIABLES LIKE 'local_infile';   
SET GLOBAL local_infile = 1;

In [16]:
# csv file 읽어서 MySQL에 넣기
data <- read.csv('../data/score.csv', header=F)
colnames(data) <- c('id', 'korean', 'english', 'mathmatics')
data

   id korean english mathmatics
1   1  90     80      70
2   2  90     88      70
3   3  90     89      70
4   4  90     87      70
5   5  90     60      70
6   6 100    100     100
7   7 100    100     100
8   8 100    100     100
9   9 100    100     100
10 10 100    100     100

In [18]:
dbWriteTable(conn, 'score', data, overwrite=T, row.names=F) 
# score이라는 테이블에 덮어쓰겠다 data를
# 추가하는 상황이면 append=T 도 포함해야한다.

[1] TRUE

In [19]:
result=dbGetQuery(conn, 'select * from score')
result

   id korean english mathmatics
1   1  90     80      70
2   2  90     88      70
3   3  90     89      70
4   4  90     87      70
5   5  90     60      70
6   6 100    100     100
7   7 100    100     100
8   8 100    100     100
9   9 100    100     100
10 10 100    100     100

In [20]:
str(result)

'data.frame':	10 obs. of  4 variables:
 $ id        : num  1 2 3 4 5 6 7 8 9 10
 $ korean    : num  90 90 90 90 90 100 100 100 100 100
 $ english   : num  80 88 89 87 60 100 100 100 100 100
 $ mathmatics: num  70 70 70 70 70 100 100 100 100 100

In [24]:
data2 <- read.csv('../data/score2.csv', header=F)
colnames(data2) <- c('id', 'korean', 'english', 'mathmatics')
data2

  id korean english mathmatics
1 11 90     80      70
2 12 90     88      70

In [61]:
dbWriteTable(conn, 'score', data2, overwrite=F, row.names=F, append=T) 
# 추가할 땐 append=T, overwrite=F
result=dbGetQuery(conn, 'select * from score')
result # 11, 12 추가됨

[1] TRUE

   id   korean english mathematics
1     1  90     80      70
2     2  90     88      70
3     3  90     89      70
4     4  90     87      70
5     5  90     60      70
6     6 100    100     100
7     7 100    100     100
8     8 100    100     100
9     9 100    100     100
10   10 100    100     100
11 2020  18     18      18
12 2021  18     18      18
13 2022  18     18      18

In [26]:
# Disconnect, 다 했을 땐 연결 종료
dbDisconnect(conn)

[1] TRUE